feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN22 */
#define IFX_PSI5_ACCEN0_EN22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN22 */
#define IFX_PSI5_ACCEN0_EN22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN22 */
#define IFX_PSI5_ACCEN0_EN22_OFF (22u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN23 */
#define IFX_PSI5_ACCEN0_EN23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN23 */
#define IFX_PSI5_ACCEN0_EN23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN23 */
#define IFX_PSI5_ACCEN0_EN23_OFF (23u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN24 */
#define IFX_PSI5_ACCEN0_EN24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN24 */
#define IFX_PSI5_ACCEN0_EN24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN24 */
#define IFX_PSI5_ACCEN0_EN24_OFF (24u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN25 */
#define IFX_PSI5_ACCEN0_EN25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN25 */
#define IFX_PSI5_ACCEN0_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN25 */
#define IFX_PSI5_ACCEN0_EN25_OFF (25u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN26 */
#define IFX_PSI5_ACCEN0_EN26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN26 */
#define IFX_PSI5_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN26 */
#define IFX_PSI5_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN27 */
#define IFX_PSI5_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN27 */
#define IFX_PSI5_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN27 */
#define IFX_PSI5_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN28 */
#define IFX_PSI5_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN28 */
#define IFX_PSI5_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN28 */
#define IFX_PSI5_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN29 */
#define IFX_PSI5_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN29 */
#define IFX_PSI5_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN29 */
#define IFX_PSI5_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN2 */
#define IFX_PSI5_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN2 */
#define IFX_PSI5_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN2 */
#define IFX_PSI5_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN30 */
#define IFX_PSI5_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN30 */
#define IFX_PSI5_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN30 */
#define IFX_PSI5_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN31 */
#define IFX_PSI5_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN31 */
#define IFX_PSI5_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN31 */
#define IFX_PSI5_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN3 */
#define IFX_PSI5_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN3 */
#define IFX_PSI5_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN3 */
#define IFX_PSI5_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN4 */
#define IFX_PSI5_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN4 */
#define IFX_PSI5_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN4 */
#define IFX_PSI5_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN5 */
#define IFX_PSI5_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN5 */
#define IFX_PSI5_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN5 */
#define IFX_PSI5_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN6 */
#define IFX_PSI5_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN6 */
#define IFX_PSI5_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN6 */
#define IFX_PSI5_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN7 */
#define IFX_PSI5_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN7 */
#define IFX_PSI5_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN7 */
#define IFX_PSI5_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN8 */
#define IFX_PSI5_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN8 */
#define IFX_PSI5_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN8 */
#define IFX_PSI5_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_PSI5_ACCEN0_Bits.EN9 */
#define IFX_PSI5_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_ACCEN0_Bits.EN9 */
#define IFX_PSI5_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_ACCEN0_Bits.EN9 */
#define IFX_PSI5_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_PSI5_CH_CTV_Bits.CTC */
#define IFX_PSI5_CH_CTV_CTC_LEN (16u)

/** \brief  Mask for Ifx_PSI5_CH_CTV_Bits.CTC */
#define IFX_PSI5_CH_CTV_CTC_MSK (0xffffu)

/** \brief  Offset for Ifx_PSI5_CH_CTV_Bits.CTC */
#define IFX_PSI5_CH_CTV_CTC_OFF (16u)

/** \brief  Length for Ifx_PSI5_CH_CTV_Bits.CTV */
#define IFX_PSI5_CH_CTV_CTV_LEN (16u)

/** \brief  Mask for Ifx_PSI5_CH_CTV_Bits.CTV */
#define IFX_PSI5_CH_CTV_CTV_MSK (0xffffu)

/** \brief  Offset for Ifx_PSI5_CH_CTV_Bits.CTV */
#define IFX_PSI5_CH_CTV_CTV_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.ALTI */
#define IFX_PSI5_CH_IOCR_ALTI_LEN (2u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.ALTI */
#define IFX_PSI5_CH_IOCR_ALTI_MSK (0x3u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.ALTI */
#define IFX_PSI5_CH_IOCR_ALTI_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.CFEG */
#define IFX_PSI5_CH_IOCR_CFEG_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.CFEG */
#define IFX_PSI5_CH_IOCR_CFEG_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.CFEG */
#define IFX_PSI5_CH_IOCR_CFEG_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.CREG */
#define IFX_PSI5_CH_IOCR_CREG_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.CREG */
#define IFX_PSI5_CH_IOCR_CREG_MSK (0x1u)

