feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.CREG */
#define IFX_PSI5_CH_IOCR_CREG_OFF (14u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.DEPTH */
#define IFX_PSI5_CH_IOCR_DEPTH_LEN (4u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.DEPTH */
#define IFX_PSI5_CH_IOCR_DEPTH_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.DEPTH */
#define IFX_PSI5_CH_IOCR_DEPTH_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.FEG */
#define IFX_PSI5_CH_IOCR_FEG_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.FEG */
#define IFX_PSI5_CH_IOCR_FEG_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.FEG */
#define IFX_PSI5_CH_IOCR_FEG_OFF (13u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.IIE */
#define IFX_PSI5_CH_IOCR_IIE_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.IIE */
#define IFX_PSI5_CH_IOCR_IIE_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.IIE */
#define IFX_PSI5_CH_IOCR_IIE_OFF (9u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.OIE */
#define IFX_PSI5_CH_IOCR_OIE_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.OIE */
#define IFX_PSI5_CH_IOCR_OIE_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.OIE */
#define IFX_PSI5_CH_IOCR_OIE_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.REG */
#define IFX_PSI5_CH_IOCR_REG_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.REG */
#define IFX_PSI5_CH_IOCR_REG_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.REG */
#define IFX_PSI5_CH_IOCR_REG_OFF (12u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.RXM */
#define IFX_PSI5_CH_IOCR_RXM_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.RXM */
#define IFX_PSI5_CH_IOCR_RXM_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.RXM */
#define IFX_PSI5_CH_IOCR_RXM_OFF (30u)

/** \brief  Length for Ifx_PSI5_CH_IOCR_Bits.TXM */
#define IFX_PSI5_CH_IOCR_TXM_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_IOCR_Bits.TXM */
#define IFX_PSI5_CH_IOCR_TXM_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_IOCR_Bits.TXM */
#define IFX_PSI5_CH_IOCR_TXM_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.BOT */
#define IFX_PSI5_CH_PGC_BOT_LEN (7u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.BOT */
#define IFX_PSI5_CH_PGC_BOT_MSK (0x7fu)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.BOT */
#define IFX_PSI5_CH_PGC_BOT_OFF (25u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.BYP */
#define IFX_PSI5_CH_PGC_BYP_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.BYP */
#define IFX_PSI5_CH_PGC_BYP_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.BYP */
#define IFX_PSI5_CH_PGC_BYP_OFF (24u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.DEL */
#define IFX_PSI5_CH_PGC_DEL_LEN (6u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.DEL */
#define IFX_PSI5_CH_PGC_DEL_MSK (0x3fu)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.DEL */
#define IFX_PSI5_CH_PGC_DEL_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.ETB */
#define IFX_PSI5_CH_PGC_ETB_LEN (3u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.ETB */
#define IFX_PSI5_CH_PGC_ETB_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.ETB */
#define IFX_PSI5_CH_PGC_ETB_OFF (16u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.ETE */
#define IFX_PSI5_CH_PGC_ETE_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.ETE */
#define IFX_PSI5_CH_PGC_ETE_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.ETE */
#define IFX_PSI5_CH_PGC_ETE_OFF (23u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.ETS */
#define IFX_PSI5_CH_PGC_ETS_LEN (3u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.ETS */
#define IFX_PSI5_CH_PGC_ETS_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.ETS */
#define IFX_PSI5_CH_PGC_ETS_OFF (20u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.PLEN */
#define IFX_PSI5_CH_PGC_PLEN_LEN (6u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.PLEN */
#define IFX_PSI5_CH_PGC_PLEN_MSK (0x3fu)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.PLEN */
#define IFX_PSI5_CH_PGC_PLEN_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.PTE */
#define IFX_PSI5_CH_PGC_PTE_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.PTE */
#define IFX_PSI5_CH_PGC_PTE_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.PTE */
#define IFX_PSI5_CH_PGC_PTE_OFF (19u)

/** \brief  Length for Ifx_PSI5_CH_PGC_Bits.TBS */
#define IFX_PSI5_CH_PGC_TBS_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_PGC_Bits.TBS */
#define IFX_PSI5_CH_PGC_TBS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_PGC_Bits.TBS */
#define IFX_PSI5_CH_PGC_TBS_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_RCRA_Bits.ASYN */
#define IFX_PSI5_CH_RCRA_ASYN_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRA_Bits.ASYN */
#define IFX_PSI5_CH_RCRA_ASYN_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRA_Bits.ASYN */
#define IFX_PSI5_CH_RCRA_ASYN_OFF (30u)

/** \brief  Length for Ifx_PSI5_CH_RCRA_Bits.AVBS */
#define IFX_PSI5_CH_RCRA_AVBS_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_RCRA_Bits.AVBS */
#define IFX_PSI5_CH_RCRA_AVBS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_RCRA_Bits.AVBS */
#define IFX_PSI5_CH_RCRA_AVBS_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_RCRA_Bits.PDL0 */
#define IFX_PSI5_CH_RCRA_PDL0_LEN (5u)

/** \brief  Mask for Ifx_PSI5_CH_RCRA_Bits.PDL0 */
#define IFX_PSI5_CH_RCRA_PDL0_MSK (0x1fu)

/** \brief  Offset for Ifx_PSI5_CH_RCRA_Bits.PDL0 */
#define IFX_PSI5_CH_RCRA_PDL0_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_RCRA_Bits.PDL1 */
#define IFX_PSI5_CH_RCRA_PDL1_LEN (5u)

/** \brief  Mask for Ifx_PSI5_CH_RCRA_Bits.PDL1 */
#define IFX_PSI5_CH_RCRA_PDL1_MSK (0x1fu)

/** \brief  Offset for Ifx_PSI5_CH_RCRA_Bits.PDL1 */
#define IFX_PSI5_CH_RCRA_PDL1_OFF (5u)

/** \brief  Length for Ifx_PSI5_CH_RCRA_Bits.PDL2 */
#define IFX_PSI5_CH_RCRA_PDL2_LEN (5u)

/** \brief  Mask for Ifx_PSI5_CH_RCRA_Bits.PDL2 */
#define IFX_PSI5_CH_RCRA_PDL2_MSK (0x1fu)

/** \brief  Offset for Ifx_PSI5_CH_RCRA_Bits.PDL2 */
#define IFX_PSI5_CH_RCRA_PDL2_OFF (10u)

/** \brief  Length for Ifx_PSI5_CH_RCRA_Bits.PDL3 */
#define IFX_PSI5_CH_RCRA_PDL3_LEN (5u)

/** \brief  Mask for Ifx_PSI5_CH_RCRA_Bits.PDL3 */
#define IFX_PSI5_CH_RCRA_PDL3_MSK (0x1fu)

