feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_OFF (6u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_OFF (15u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_OFF (14u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_OFF (25u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.INH */
#define IFX_PSI5_CH_SCR_INH_OFF (24u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.PLL */
#define IFX_PSI5_CH_SCR_PLL_LEN (6u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.PLL */
#define IFX_PSI5_CH_SCR_PLL_MSK (0x3fu)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.PLL */
#define IFX_PSI5_CH_SCR_PLL_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.SOL */
#define IFX_PSI5_CH_SCR_SOL_LEN (6u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.SOL */
#define IFX_PSI5_CH_SCR_SOL_MSK (0x3fu)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.SOL */
#define IFX_PSI5_CH_SCR_SOL_OFF (16u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.SSL */
#define IFX_PSI5_CH_SCR_SSL_LEN (6u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.SSL */
#define IFX_PSI5_CH_SCR_SSL_MSK (0x3fu)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.SSL */
#define IFX_PSI5_CH_SCR_SSL_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.STA */
#define IFX_PSI5_CH_SCR_STA_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.STA */
#define IFX_PSI5_CH_SCR_STA_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.STA */
#define IFX_PSI5_CH_SCR_STA_OFF (23u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.TOF */
#define IFX_PSI5_CH_SCR_TOF_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.TOF */
#define IFX_PSI5_CH_SCR_TOF_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.TOF */
#define IFX_PSI5_CH_SCR_TOF_OFF (28u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.TPF */
#define IFX_PSI5_CH_SCR_TPF_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.TPF */
#define IFX_PSI5_CH_SCR_TPF_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.TPF */
#define IFX_PSI5_CH_SCR_TPF_OFF (26u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.TRQ */
#define IFX_PSI5_CH_SCR_TRQ_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.TRQ */
#define IFX_PSI5_CH_SCR_TRQ_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.TRQ */
#define IFX_PSI5_CH_SCR_TRQ_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_SCR_Bits.TSF */
#define IFX_PSI5_CH_SCR_TSF_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SCR_Bits.TSF */
#define IFX_PSI5_CH_SCR_TSF_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SCR_Bits.TSF */
#define IFX_PSI5_CH_SCR_TSF_OFF (27u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD32 */
#define IFX_PSI5_CH_SDRH_SD32_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD32 */
#define IFX_PSI5_CH_SDRH_SD32_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD32 */
#define IFX_PSI5_CH_SDRH_SD32_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD33 */
#define IFX_PSI5_CH_SDRH_SD33_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD33 */
#define IFX_PSI5_CH_SDRH_SD33_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD33 */
#define IFX_PSI5_CH_SDRH_SD33_OFF (1u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD34 */
#define IFX_PSI5_CH_SDRH_SD34_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD34 */
#define IFX_PSI5_CH_SDRH_SD34_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD34 */
#define IFX_PSI5_CH_SDRH_SD34_OFF (2u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD35 */
#define IFX_PSI5_CH_SDRH_SD35_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD35 */
#define IFX_PSI5_CH_SDRH_SD35_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD35 */
#define IFX_PSI5_CH_SDRH_SD35_OFF (3u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD36 */
#define IFX_PSI5_CH_SDRH_SD36_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD36 */
#define IFX_PSI5_CH_SDRH_SD36_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD36 */
#define IFX_PSI5_CH_SDRH_SD36_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD37 */
#define IFX_PSI5_CH_SDRH_SD37_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD37 */
#define IFX_PSI5_CH_SDRH_SD37_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD37 */
#define IFX_PSI5_CH_SDRH_SD37_OFF (5u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD38 */
#define IFX_PSI5_CH_SDRH_SD38_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD38 */
#define IFX_PSI5_CH_SDRH_SD38_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD38 */
#define IFX_PSI5_CH_SDRH_SD38_OFF (6u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD39 */
#define IFX_PSI5_CH_SDRH_SD39_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD39 */
#define IFX_PSI5_CH_SDRH_SD39_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD39 */
#define IFX_PSI5_CH_SDRH_SD39_OFF (7u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD40 */
#define IFX_PSI5_CH_SDRH_SD40_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD40 */
#define IFX_PSI5_CH_SDRH_SD40_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD40 */
#define IFX_PSI5_CH_SDRH_SD40_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD41 */
#define IFX_PSI5_CH_SDRH_SD41_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD41 */
#define IFX_PSI5_CH_SDRH_SD41_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD41 */
#define IFX_PSI5_CH_SDRH_SD41_OFF (9u)

/** \brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD42 */
#define IFX_PSI5_CH_SDRH_SD42_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD42 */
#define IFX_PSI5_CH_SDRH_SD42_MSK (0x1u)

