feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_OFF (31u)

/** \brief  Length for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_OFF (3u)

/** \brief  Length for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_OFF (5u)

/** \brief  Length for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_OFF (6u)

/** \brief  Length for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_OFF (7u)

/** \brief  Length for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_OFF (9u)

/** \brief  Length for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_LEN (24u)

/** \brief  Mask for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_MSK (0xffffffu)

/** \brief  Offset for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_OFF (0u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_OFF (1u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_OFF (2u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_OFF (3u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_OFF (5u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_OFF (6u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_OFF (7u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_OFF (9u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_OFF (10u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_OFF (11u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD44 */
#define IFX_PSI5_CH_SSRH_SD44_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD44 */
#define IFX_PSI5_CH_SSRH_SD44_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD44 */
#define IFX_PSI5_CH_SSRH_SD44_OFF (12u)

/** \brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD45 */
#define IFX_PSI5_CH_SSRH_SD45_LEN (1u)

