feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD3 */
#define IFX_PSI5_CH_SSRL_SD3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD3 */
#define IFX_PSI5_CH_SSRL_SD3_OFF (3u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD4 */
#define IFX_PSI5_CH_SSRL_SD4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD4 */
#define IFX_PSI5_CH_SSRL_SD4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD4 */
#define IFX_PSI5_CH_SSRL_SD4_OFF (4u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD5 */
#define IFX_PSI5_CH_SSRL_SD5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD5 */
#define IFX_PSI5_CH_SSRL_SD5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD5 */
#define IFX_PSI5_CH_SSRL_SD5_OFF (5u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD6 */
#define IFX_PSI5_CH_SSRL_SD6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD6 */
#define IFX_PSI5_CH_SSRL_SD6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD6 */
#define IFX_PSI5_CH_SSRL_SD6_OFF (6u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD7 */
#define IFX_PSI5_CH_SSRL_SD7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD7 */
#define IFX_PSI5_CH_SSRL_SD7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD7 */
#define IFX_PSI5_CH_SSRL_SD7_OFF (7u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD8 */
#define IFX_PSI5_CH_SSRL_SD8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD8 */
#define IFX_PSI5_CH_SSRL_SD8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD8 */
#define IFX_PSI5_CH_SSRL_SD8_OFF (8u)

/** \brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD9 */
#define IFX_PSI5_CH_SSRL_SD9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD9 */
#define IFX_PSI5_CH_SSRL_SD9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD9 */
#define IFX_PSI5_CH_SSRL_SD9_OFF (9u)

/** \brief  Length for Ifx_PSI5_CH_WDT_Bits.WDLxw */
#define IFX_PSI5_CH_WDT_WDLXW_LEN (16u)

/** \brief  Mask for Ifx_PSI5_CH_WDT_Bits.WDLxw */
#define IFX_PSI5_CH_WDT_WDLXW_MSK (0xffffu)

/** \brief  Offset for Ifx_PSI5_CH_WDT_Bits.WDLxw */
#define IFX_PSI5_CH_WDT_WDLXW_OFF (0u)

/** \brief  Length for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_OFF (20u)

