feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_OFF (20u)

/** \brief  Length for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_OFF (28u)

/** \brief  Length for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_OFF (8u)

/** \brief  Length for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_OFF (4u)

/** \brief  Length for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_OFF (0u)

/** \brief  Length for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_OFF (24u)

/** \brief  Length for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_OFF (16u)

/** \brief  Length for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_LEN (4u)

/** \brief  Mask for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_MSK (0xfu)

/** \brief  Offset for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_OFF (6u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_OFF (7u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_OFF (5u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_OFF (4u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_OFF (16u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_OFF (9u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_OFF (8u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_OFF (14u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_OFF (15u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_OFF (10u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_OFF (11u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.TSI */
#define IFX_PSI5_INTCLRA_TSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.TSI */
#define IFX_PSI5_INTCLRA_TSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.TSI */
#define IFX_PSI5_INTCLRA_TSI_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTCLRA_Bits.TSOI */
#define IFX_PSI5_INTCLRA_TSOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRA_Bits.TSOI */
#define IFX_PSI5_INTCLRA_TSOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRA_Bits.TSOI */
#define IFX_PSI5_INTCLRA_TSOI_OFF (13u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SCRI0 */
#define IFX_PSI5_INTCLRB_SCRI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTCLRB_Bits.SCRI0 */
#define IFX_PSI5_INTCLRB_SCRI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTCLRB_Bits.SCRI0 */
#define IFX_PSI5_INTCLRB_SCRI0_OFF (18u)

/** \brief  Length for Ifx_PSI5_INTCLRB_Bits.SCRI1 */
#define IFX_PSI5_INTCLRB_SCRI1_LEN (1u)

