feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_INTENB_Bits.SDI2 */
#define IFX_PSI5_INTENB_SDI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SDI2 */
#define IFX_PSI5_INTENB_SDI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SDI2 */
#define IFX_PSI5_INTENB_SDI2_OFF (8u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SDI3 */
#define IFX_PSI5_INTENB_SDI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SDI3 */
#define IFX_PSI5_INTENB_SDI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SDI3 */
#define IFX_PSI5_INTENB_SDI3_OFF (9u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SDI4 */
#define IFX_PSI5_INTENB_SDI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SDI4 */
#define IFX_PSI5_INTENB_SDI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SDI4 */
#define IFX_PSI5_INTENB_SDI4_OFF (10u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SDI5 */
#define IFX_PSI5_INTENB_SDI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SDI5 */
#define IFX_PSI5_INTENB_SDI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SDI5 */
#define IFX_PSI5_INTENB_SDI5_OFF (11u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SOI0 */
#define IFX_PSI5_INTENB_SOI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SOI0 */
#define IFX_PSI5_INTENB_SOI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SOI0 */
#define IFX_PSI5_INTENB_SOI0_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SOI1 */
#define IFX_PSI5_INTENB_SOI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SOI1 */
#define IFX_PSI5_INTENB_SOI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SOI1 */
#define IFX_PSI5_INTENB_SOI1_OFF (13u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SOI2 */
#define IFX_PSI5_INTENB_SOI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SOI2 */
#define IFX_PSI5_INTENB_SOI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SOI2 */
#define IFX_PSI5_INTENB_SOI2_OFF (14u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SOI3 */
#define IFX_PSI5_INTENB_SOI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SOI3 */
#define IFX_PSI5_INTENB_SOI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SOI3 */
#define IFX_PSI5_INTENB_SOI3_OFF (15u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SOI4 */
#define IFX_PSI5_INTENB_SOI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SOI4 */
#define IFX_PSI5_INTENB_SOI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SOI4 */
#define IFX_PSI5_INTENB_SOI4_OFF (16u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.SOI5 */
#define IFX_PSI5_INTENB_SOI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.SOI5 */
#define IFX_PSI5_INTENB_SOI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.SOI5 */
#define IFX_PSI5_INTENB_SOI5_OFF (17u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.WSI0 */
#define IFX_PSI5_INTENB_WSI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.WSI0 */
#define IFX_PSI5_INTENB_WSI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.WSI0 */
#define IFX_PSI5_INTENB_WSI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.WSI1 */
#define IFX_PSI5_INTENB_WSI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.WSI1 */
#define IFX_PSI5_INTENB_WSI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.WSI1 */
#define IFX_PSI5_INTENB_WSI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.WSI2 */
#define IFX_PSI5_INTENB_WSI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.WSI2 */
#define IFX_PSI5_INTENB_WSI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.WSI2 */
#define IFX_PSI5_INTENB_WSI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.WSI3 */
#define IFX_PSI5_INTENB_WSI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.WSI3 */
#define IFX_PSI5_INTENB_WSI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.WSI3 */
#define IFX_PSI5_INTENB_WSI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.WSI4 */
#define IFX_PSI5_INTENB_WSI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.WSI4 */
#define IFX_PSI5_INTENB_WSI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.WSI4 */
#define IFX_PSI5_INTENB_WSI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_INTENB_Bits.WSI5 */
#define IFX_PSI5_INTENB_WSI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTENB_Bits.WSI5 */
#define IFX_PSI5_INTENB_WSI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTENB_Bits.WSI5 */
#define IFX_PSI5_INTENB_WSI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.ERRI */
#define IFX_PSI5_INTOV_ERRI_OFF (5u)

/** \brief  Length for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.FWI */
#define IFX_PSI5_INTOV_FWI_OFF (7u)

/** \brief  Length for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.RBI */
#define IFX_PSI5_INTOV_RBI_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.RDI */
#define IFX_PSI5_INTOV_RDI_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.RSI */
#define IFX_PSI5_INTOV_RSI_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.SDI */
#define IFX_PSI5_INTOV_SDI_OFF (6u)

/** \brief  Length for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTOV_Bits.TBI */
#define IFX_PSI5_INTOV_TBI_OFF (4u)

