feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.NBI */
#define IFX_PSI5_INTSTATA_NBI_OFF (4u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_OFF (16u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_OFF (9u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_OFF (8u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_OFF (14u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_OFF (15u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_OFF (10u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_OFF (11u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTSTATA_Bits.TSOI */
#define IFX_PSI5_INTSTATA_TSOI_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATA_Bits.TSOI */
#define IFX_PSI5_INTSTATA_TSOI_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATA_Bits.TSOI */
#define IFX_PSI5_INTSTATA_TSOI_OFF (13u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SCRI0 */
#define IFX_PSI5_INTSTATB_SCRI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SCRI0 */
#define IFX_PSI5_INTSTATB_SCRI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SCRI0 */
#define IFX_PSI5_INTSTATB_SCRI0_OFF (18u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SCRI1 */
#define IFX_PSI5_INTSTATB_SCRI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SCRI1 */
#define IFX_PSI5_INTSTATB_SCRI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SCRI1 */
#define IFX_PSI5_INTSTATB_SCRI1_OFF (19u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SCRI2 */
#define IFX_PSI5_INTSTATB_SCRI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SCRI2 */
#define IFX_PSI5_INTSTATB_SCRI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SCRI2 */
#define IFX_PSI5_INTSTATB_SCRI2_OFF (20u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SCRI3 */
#define IFX_PSI5_INTSTATB_SCRI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SCRI3 */
#define IFX_PSI5_INTSTATB_SCRI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SCRI3 */
#define IFX_PSI5_INTSTATB_SCRI3_OFF (21u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SCRI4 */
#define IFX_PSI5_INTSTATB_SCRI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SCRI4 */
#define IFX_PSI5_INTSTATB_SCRI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SCRI4 */
#define IFX_PSI5_INTSTATB_SCRI4_OFF (22u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SCRI5 */
#define IFX_PSI5_INTSTATB_SCRI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SCRI5 */
#define IFX_PSI5_INTSTATB_SCRI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SCRI5 */
#define IFX_PSI5_INTSTATB_SCRI5_OFF (23u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SDI0 */
#define IFX_PSI5_INTSTATB_SDI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SDI0 */
#define IFX_PSI5_INTSTATB_SDI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SDI0 */
#define IFX_PSI5_INTSTATB_SDI0_OFF (6u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SDI1 */
#define IFX_PSI5_INTSTATB_SDI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SDI1 */
#define IFX_PSI5_INTSTATB_SDI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SDI1 */
#define IFX_PSI5_INTSTATB_SDI1_OFF (7u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SDI2 */
#define IFX_PSI5_INTSTATB_SDI2_LEN (1u)

