feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SDI2 */
#define IFX_PSI5_INTSTATB_SDI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SDI2 */
#define IFX_PSI5_INTSTATB_SDI2_OFF (8u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SDI3 */
#define IFX_PSI5_INTSTATB_SDI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SDI3 */
#define IFX_PSI5_INTSTATB_SDI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SDI3 */
#define IFX_PSI5_INTSTATB_SDI3_OFF (9u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SDI4 */
#define IFX_PSI5_INTSTATB_SDI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SDI4 */
#define IFX_PSI5_INTSTATB_SDI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SDI4 */
#define IFX_PSI5_INTSTATB_SDI4_OFF (10u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SDI5 */
#define IFX_PSI5_INTSTATB_SDI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SDI5 */
#define IFX_PSI5_INTSTATB_SDI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SDI5 */
#define IFX_PSI5_INTSTATB_SDI5_OFF (11u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SOI0 */
#define IFX_PSI5_INTSTATB_SOI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SOI0 */
#define IFX_PSI5_INTSTATB_SOI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SOI0 */
#define IFX_PSI5_INTSTATB_SOI0_OFF (12u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SOI1 */
#define IFX_PSI5_INTSTATB_SOI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SOI1 */
#define IFX_PSI5_INTSTATB_SOI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SOI1 */
#define IFX_PSI5_INTSTATB_SOI1_OFF (13u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SOI2 */
#define IFX_PSI5_INTSTATB_SOI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SOI2 */
#define IFX_PSI5_INTSTATB_SOI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SOI2 */
#define IFX_PSI5_INTSTATB_SOI2_OFF (14u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SOI3 */
#define IFX_PSI5_INTSTATB_SOI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SOI3 */
#define IFX_PSI5_INTSTATB_SOI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SOI3 */
#define IFX_PSI5_INTSTATB_SOI3_OFF (15u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SOI4 */
#define IFX_PSI5_INTSTATB_SOI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SOI4 */
#define IFX_PSI5_INTSTATB_SOI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SOI4 */
#define IFX_PSI5_INTSTATB_SOI4_OFF (16u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.SOI5 */
#define IFX_PSI5_INTSTATB_SOI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.SOI5 */
#define IFX_PSI5_INTSTATB_SOI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.SOI5 */
#define IFX_PSI5_INTSTATB_SOI5_OFF (17u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI0 */
#define IFX_PSI5_INTSTATB_WSI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI0 */
#define IFX_PSI5_INTSTATB_WSI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI0 */
#define IFX_PSI5_INTSTATB_WSI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_MSK (0x1u)

