feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_OFF (5u)

