feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI14 */
#define IFX_PSI5_NBICLR_NBI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI14 */
#define IFX_PSI5_NBICLR_NBI14_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI14 */
#define IFX_PSI5_NBICLR_NBI14_OFF (14u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI15 */
#define IFX_PSI5_NBICLR_NBI15_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI15 */
#define IFX_PSI5_NBICLR_NBI15_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI15 */
#define IFX_PSI5_NBICLR_NBI15_OFF (15u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI16 */
#define IFX_PSI5_NBICLR_NBI16_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI16 */
#define IFX_PSI5_NBICLR_NBI16_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI16 */
#define IFX_PSI5_NBICLR_NBI16_OFF (16u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI17 */
#define IFX_PSI5_NBICLR_NBI17_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI17 */
#define IFX_PSI5_NBICLR_NBI17_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI17 */
#define IFX_PSI5_NBICLR_NBI17_OFF (17u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI18 */
#define IFX_PSI5_NBICLR_NBI18_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI18 */
#define IFX_PSI5_NBICLR_NBI18_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI18 */
#define IFX_PSI5_NBICLR_NBI18_OFF (18u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI19 */
#define IFX_PSI5_NBICLR_NBI19_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI19 */
#define IFX_PSI5_NBICLR_NBI19_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI19 */
#define IFX_PSI5_NBICLR_NBI19_OFF (19u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI1 */
#define IFX_PSI5_NBICLR_NBI1_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI1 */
#define IFX_PSI5_NBICLR_NBI1_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI1 */
#define IFX_PSI5_NBICLR_NBI1_OFF (1u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI20 */
#define IFX_PSI5_NBICLR_NBI20_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI20 */
#define IFX_PSI5_NBICLR_NBI20_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI20 */
#define IFX_PSI5_NBICLR_NBI20_OFF (20u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI21 */
#define IFX_PSI5_NBICLR_NBI21_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI21 */
#define IFX_PSI5_NBICLR_NBI21_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI21 */
#define IFX_PSI5_NBICLR_NBI21_OFF (21u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI22 */
#define IFX_PSI5_NBICLR_NBI22_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI22 */
#define IFX_PSI5_NBICLR_NBI22_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI22 */
#define IFX_PSI5_NBICLR_NBI22_OFF (22u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI23 */
#define IFX_PSI5_NBICLR_NBI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI23 */
#define IFX_PSI5_NBICLR_NBI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI23 */
#define IFX_PSI5_NBICLR_NBI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI24 */
#define IFX_PSI5_NBICLR_NBI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI24 */
#define IFX_PSI5_NBICLR_NBI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI24 */
#define IFX_PSI5_NBICLR_NBI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI25 */
#define IFX_PSI5_NBICLR_NBI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI25 */
#define IFX_PSI5_NBICLR_NBI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI25 */
#define IFX_PSI5_NBICLR_NBI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_NBICLR_Bits.NBI26 */
#define IFX_PSI5_NBICLR_NBI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI26 */
#define IFX_PSI5_NBICLR_NBI26_MSK (0x1u)

