feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_OFF (0u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_OFF (10u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_OFF (11u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_OFF (12u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_OFF (13u)

/** \brief  Length for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_LEN (1u)

/** \brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_MSK (0x1u)

