feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxPsi5_bf.h
/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_OFF (23u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_OFF (24u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_OFF (25u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_OFF (26u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_OFF (27u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_OFF (28u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_OFF (29u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI2 */
#define IFX_PSI5_TEISET_TEI2_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI2 */
#define IFX_PSI5_TEISET_TEI2_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI2 */
#define IFX_PSI5_TEISET_TEI2_OFF (2u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_OFF (30u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_OFF (31u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI3 */
#define IFX_PSI5_TEISET_TEI3_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI3 */
#define IFX_PSI5_TEISET_TEI3_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI3 */
#define IFX_PSI5_TEISET_TEI3_OFF (3u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI4 */
#define IFX_PSI5_TEISET_TEI4_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI4 */
#define IFX_PSI5_TEISET_TEI4_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI4 */
#define IFX_PSI5_TEISET_TEI4_OFF (4u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI5 */
#define IFX_PSI5_TEISET_TEI5_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI5 */
#define IFX_PSI5_TEISET_TEI5_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI5 */
#define IFX_PSI5_TEISET_TEI5_OFF (5u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI6 */
#define IFX_PSI5_TEISET_TEI6_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI6 */
#define IFX_PSI5_TEISET_TEI6_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI6 */
#define IFX_PSI5_TEISET_TEI6_OFF (6u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI7 */
#define IFX_PSI5_TEISET_TEI7_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI7 */
#define IFX_PSI5_TEISET_TEI7_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI7 */
#define IFX_PSI5_TEISET_TEI7_OFF (7u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI8 */
#define IFX_PSI5_TEISET_TEI8_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI8 */
#define IFX_PSI5_TEISET_TEI8_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI8 */
#define IFX_PSI5_TEISET_TEI8_OFF (8u)

/** \brief  Length for Ifx_PSI5_TEISET_Bits.TEI9 */
#define IFX_PSI5_TEISET_TEI9_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TEISET_Bits.TEI9 */
#define IFX_PSI5_TEISET_TEI9_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TEISET_Bits.TEI9 */
#define IFX_PSI5_TEISET_TEI9_OFF (9u)

/** \brief  Length for Ifx_PSI5_TSR_Bits.ACLR */
#define IFX_PSI5_TSR_ACLR_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TSR_Bits.ACLR */
#define IFX_PSI5_TSR_ACLR_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TSR_Bits.ACLR */
#define IFX_PSI5_TSR_ACLR_OFF (30u)

/** \brief  Length for Ifx_PSI5_TSR_Bits.CLR */
#define IFX_PSI5_TSR_CLR_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TSR_Bits.CLR */
#define IFX_PSI5_TSR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TSR_Bits.CLR */
#define IFX_PSI5_TSR_CLR_OFF (31u)

/** \brief  Length for Ifx_PSI5_TSR_Bits.CTS */
#define IFX_PSI5_TSR_CTS_LEN (24u)

/** \brief  Mask for Ifx_PSI5_TSR_Bits.CTS */
#define IFX_PSI5_TSR_CTS_MSK (0xffffffu)

/** \brief  Offset for Ifx_PSI5_TSR_Bits.CTS */
#define IFX_PSI5_TSR_CTS_OFF (0u)

/** \brief  Length for Ifx_PSI5_TSR_Bits.ETB */
#define IFX_PSI5_TSR_ETB_LEN (3u)

/** \brief  Mask for Ifx_PSI5_TSR_Bits.ETB */
#define IFX_PSI5_TSR_ETB_MSK (0x7u)

/** \brief  Offset for Ifx_PSI5_TSR_Bits.ETB */
#define IFX_PSI5_TSR_ETB_OFF (24u)

/** \brief  Length for Ifx_PSI5_TSR_Bits.TBS */
#define IFX_PSI5_TSR_TBS_LEN (1u)

/** \brief  Mask for Ifx_PSI5_TSR_Bits.TBS */
#define IFX_PSI5_TSR_TBS_MSK (0x1u)

/** \brief  Offset for Ifx_PSI5_TSR_Bits.TBS */
#define IFX_PSI5_TSR_TBS_OFF (27u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_BF_H */
